name = input("이름 : ")
print("-*" * 8, "%s의 영화예매기" %(name), "-*" *8)

while(True):
    print(" 1. 닥터 스트레인지", "\n 2. 어벤져스 5", "\n 3. 예매 완료")
    print("-*" * 21)

    num = int(input("번호를 선택해주세요 : "))

    while(num >= 4):
        print("\n잘못 선택하셨습니다. 다시 입력해주세요.")
        num = int(input("번호를 선택해주세요 : "))



    
    if(num == 1):
        print("-" * 9, "시간 대", "-" *9)
        print("1. 특  별  관 7:30 ~ 9:40", "\n2. 일반상영관 12:20 ~ 14:30", "\n3. 일반상영관 18:10 ~ 20:20")

    elif(num == 2):
        print("-" * 9, "시간 대", "-" *9)
        print("1. 특  별  관 9:30 ~ 11:00", "\n2. 일반상영관 12:20 ~ 13:50", "\n3. 일반상영관 14:10 ~ 15:40")

    elif(num == 3):
        break
        
    print("-" * 30)

    time = int(input("시간 대를 선택해주세요 : "))



    print("\n","*-" * 8, "좌 석", "*-" *8)
    if(time == 1):
        list = [["1", "2", "3", "4", "5", "6", "7"], ["1", "2", "3", "4", "5", "6", "7"],
        ["1", "2", "3", "4", "5", "6", "7"], ["1", "2", "3", "4", "5", "6", "7"], ["1", "2", "3", "4", "5", "6", "7"]]
        print("1열",list[0], "\n2열",list[1], "\n3열",list[2], "\n4열",list[3], "\n5열",list[4])
        print("*-" *20)

    elif(time == 2):
        list = [["1", "2", "3", "4", "5"], ["1", "2", "3", "4", "5"],
        ["1", "2", "3", "4", "5"], ["1", "2", "3", "4", "5"], ["1", "2", "3", "4", "5"], ["1", "2", "3", "4", "5"]]
        print("1열",list[0], "\n2열",list[1], "\n3열",list[2], "\n4열",list[3], "\n5열",list[4] ,"\n6열",list[5])
        print("*-" * 20)

    elif(time == 3):
        list = [["1", "2", "3", "4"], ["1", "2", "3", "4"], ["1", "2", "3", "4"], 
        ["1", "2", "3", "4"], ["1", "2", "3", "4"], ["1", "2", "3", "4"],["1", "2", "3", "4"] ]
        print("1열",list[0], "\n2열",list[1], "\n3열",list[2], "\n4열",list[3], "\n5열",list[4] ,"\n6열",list[5], "\n7열",list[6])
        print("*-" * 20)
    
    
    print("좌석을 입력해주세요.")
    row = int(input("열 : "))
    line = int(input("행 : "))


    print("%d열 %d행을 선택하셨습니다." %(row, line))
